Tekla Open API Reference for Tekla Structures 2025
PluginSymbolVisiblityAttribute Class
 The PluginSymbolVisiblityAttribute class is used for defining the symbol visibility for model plug-ins. The attribute is initialized from the custom attribute [PluginSymbolVisiblity(PluginBase.SymbolVisibility Type)] in the plug-in source. If attribute is not defined or attribute has value PluginBase.SymbolVisibility.DRAW_SYMBOL plug-in symbol is drawn normally.
Inheritance Hierarchy
System.Object
 System.Attribute
 Tekla.Structures.Plugins.PluginSymbolVisiblityAttribute
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class PluginSymbolVisiblityAttribute : Attribute
Public NotInheritable Class PluginSymbolVisiblityAttribute
	Inherits Attribute
The PluginSymbolVisiblityAttribute type exposes the following members.
Constructors
Name | Description
PluginSymbolVisiblityAttribute(Int32)
 The custom attribute used to define coordinate system of the plug-in. This is not to be used by itself.
PluginSymbolVisiblityAttribute(PluginBase.SymbolVisibility)
 The custom attribute used to define coordinate system of the plug-in. This is not to be used by itself.
Top
Properties
Name | Description
Type
 Returns the type of the input object dependency.
Top
See Also
Reference
Tekla.Structures.Plugins Namespace